tests/load/artillery/core-journeys.yml
config:
  target: "{{ $processEnvironment.TARGET_BASE_URL || 'https://staging.prisma.glow' }}"
  phases:
    - duration: 60
      arrivalRate: 5
      name: warm-up
    - duration: 120
      arrivalRate: 10
      rampTo: 25
      name: ramp-and-hold
  defaults:
    headers:
      User-Agent: prisma-core-journeys-load-test
      Cache-Control: 'max-age=0'
  plugins:
    ensure:
      thresholds:
        http.response_time:
          - p(95) < 800
        http.codes.429:
          - max == 0
  processor: ./processors/core-journeys.mjs
  payload:
    path: ./fixtures/personas.csv
    fields:
      - email
      - password
      - orgSlug
scenarios:
  - name: auth + agent chat + document upload
    flow:
      - get:
          url: /api/healthz
        expect:
          - statusCode: 200
      - think: 1
      - post:
          url: /api/auth/token/issue
          json:
            email: "{{ email }}"
            password: "{{ password }}"
        capture:
          - json: $.accessToken
            as: token
        expect:
          - statusCode: 200
      - function: authorise
      - post:
          url: /api/agent/start
          json:
            orgSlug: "{{ orgSlug }}"
            agentType: AUDIT
        capture:
          - json: $.sessionId
            as: sessionId
        expect:
          - statusCode: 200
      - think: 1
      - get:
          url: "/api/agent/conversations?orgSlug={{ orgSlug }}&limit=20"
        expect:
          - statusCode: 200
      - think: 1
      - post:
          url: /client/upload
          headers:
            Content-Type: multipart/form-data
          formData:
            file:
              value: "{{ file('fixtures/sample.pdf') }}"
              contentType: application/pdf
        expect:
          - statusCode: 200
      - think: 1
      - get:
          url: /api/rate-limit/status
        expect:
          - statusCode: 200